Pandas

Package for managing data similar to numpy but this is more robust methods using Series and dataframe.

In [ ]:
import pandas as pd;
import numpy as np;

In [ ]:
myList = [1,2,3,4,5];
myArray = np.array(myList);
print(myArray);

[1 2 3 4 5]

In [ ]:
mySeries1 = pd.Series(data= myList);
print(mySeries1);
print(mySeries1[2]);
print("------------");
mySeries2 = pd.Series(data = myArray);
print(mySeries2);

0    1
1    2
2    3
3    4
4    5
dtype: int64
3
------------
0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
#we can create our own index for Series
myLabel = ['first','second','third','fourth','fifth'];
mySeries3 = pd.Series(data = myList, index = myLabel);
print(mySeries3);

first     1
second    2
third     3
fourth    4
fifth     5
dtype: int64

In [ ]:
mySeries4 = pd.Series(myList,myLabel);
print(mySeries4);
print(mySeries4['third']);

first     1
second    2
third     3
fourth    4
fifth     5
dtype: int64
3

In [ ]:
mySeries5 = pd.Series([6,7,8,9],['first','third','fourth','sixth']);
print(mySeries5);
print('');
print(mySeries5+mySeries4);

first     6
third     7
fourth    8
sixth     9
dtype: int64

fifth      NaN
first      7.0
fourth    12.0
second     NaN
sixth      NaN
third     10.0
dtype: float64

In [ ]:
df1 = pd.concat([mySeries4,mySeries5],axis =1 , sort= False);
df1

          0    1
first   1.0  6.0
second  2.0  NaN
third   3.0  7.0
fourth  4.0  8.0
fifth   5.0  NaN
sixth   NaN  9.0

In [ ]:
df2 = pd.DataFrame(np.random.randn(5,5));
print(df2);

          0         1         2         3         4
0 -0.330120 -1.938329 -0.940977 -1.586456 -0.558888
1  0.150957 -0.989331 -0.870442  0.016839  0.538771
2 -1.523125  0.776861 -1.373837 -0.039265 -0.768582
3  0.171643 -1.808246 -0.677920 -0.093655  1.677455
4  0.026121  1.578829 -0.546119 -1.503225  1.225691

In [ ]:
df3 = pd.DataFrame(np.random.randn(4,2), ['1st row','2nd row','3rd row','4th row'],['first','second']);
print(df3);
print("----");
print(df3['second']);
print(df3[['second','first']]);

            first    second
1st row -1.683562 -0.017405
2nd row -1.234513  0.081994
3rd row -1.345732 -0.794459
4th row  1.079657 -0.199138
----
1st row   -0.017405
2nd row    0.081994
3rd row   -0.794459
4th row   -0.199138
Name: second, dtype: float64
           second     first
1st row -0.017405 -1.683562
2nd row  0.081994 -1.234513
3rd row -0.794459 -1.345732
4th row -0.199138  1.079657

In [ ]:
print(df3.loc['1st row']);
print(df3.iloc[0]);

print("----------");
print(df3.loc[['1st row','4th row']]);

first    -1.683562
second   -0.017405
Name: 1st row, dtype: float64
first    -1.683562
second   -0.017405
Name: 1st row, dtype: float64
----------
            first    second
1st row -1.683562 -0.017405
4th row  1.079657 -0.199138

In [ ]:
print(df3>0);
print(df3[df3>0])

         first  second
1st row  False   False
2nd row  False    True
3rd row  False   False
4th row   True   False
            first    second
1st row       NaN       NaN
2nd row       NaN  0.081994
3rd row       NaN       NaN
4th row  1.079657       NaN

In [ ]:
df3['third'] = np.random.randn(4,1);
df3

            first    second     third
1st row -1.683562 -0.017405 -0.120003
2nd row -1.234513  0.081994 -1.355192
3rd row -1.345732 -0.794459  1.106069
4th row  1.079657 -0.199138 -2.569288

In [ ]:
df4 = df3.drop('third',axis = 1);
df4

            first    second
1st row -1.683562 -0.017405
2nd row -1.234513  0.081994
3rd row -1.345732 -0.794459
4th row  1.079657 -0.199138

In [ ]:
df5 = df3.drop('4th row',axis=0);
df5

            first    second     third
1st row -1.683562 -0.017405 -0.120003
2nd row -1.234513  0.081994 -1.355192
3rd row -1.345732 -0.794459  1.106069

In [ ]:
df5.reset_index()

     index     first    second     third
0  1st row -1.683562 -0.017405 -0.120003
1  2nd row -1.234513  0.081994 -1.355192
2  3rd row -1.345732 -0.794459  1.106069

In [ ]:
#df5.reset_index(inplace=True);
#df5.set_index('index',inplace=True)
#df5.drop('level_0',axis = 1, inplace= True);
print(df5)

            first    second     third
1st row -1.683562 -0.017405 -0.120003
2nd row -1.234513  0.081994 -1.355192
3rd row -1.345732 -0.794459  1.106069

In [ ]:
df3.drop('first',axis = 1, inplace=True);
df3

           second     third
1st row -0.017405 -0.120003
2nd row  0.081994 -1.355192
3rd row -0.794459  1.106069
4th row -0.199138 -2.569288

Combining Data Frames

1)Concat

2)Join

3)Merge

In [ ]:
df7 = pd.DataFrame({"customer":[1,2,3,4],
                    "cat":["cat1","cat2","cat3","cat4"],
                    "imp":['yes','no','yes','yes'],
                    "sales":[100,115,90,80]},index = [0,1,2,3]);
df8 = pd.DataFrame({"customer":[1,3,4,5],
                    "color":["yellow","pink","pink","green"],
                    "dist":[10, 50, 20, 15],
                    "sales":[110,215,190,810]},index=[4,5,6,7]);

In [ ]:
pd.concat([df7,df8],axis= 0, sort= False)

   customer   cat  imp  sales   color  dist
0         1  cat1  yes    100     NaN   NaN
1         2  cat2   no    115     NaN   NaN
2         3  cat3  yes     90     NaN   NaN
3         4  cat4  yes     80     NaN   NaN
4         1   NaN  NaN    110  yellow  10.0
5         3   NaN  NaN    215    pink  50.0
6         4   NaN  NaN    190    pink  20.0
7         5   NaN  NaN    810   green  15.0

In [ ]:
pd.concat([df7,df8],axis=1,sort=False)
#this axis =1 concat works based on index. If we manually give the index this will affect the result

   customer   cat  imp  sales  customer   color  dist  sales
0       1.0  cat1  yes  100.0       NaN     NaN   NaN    NaN
1       2.0  cat2   no  115.0       NaN     NaN   NaN    NaN
2       3.0  cat3  yes   90.0       NaN     NaN   NaN    NaN
3       4.0  cat4  yes   80.0       NaN     NaN   NaN    NaN
4       NaN   NaN  NaN    NaN       1.0  yellow  10.0  110.0
5       NaN   NaN  NaN    NaN       3.0    pink  50.0  215.0
6       NaN   NaN  NaN    NaN       4.0    pink  20.0  190.0
7       NaN   NaN  NaN    NaN       5.0   green  15.0  810.0

Merge and Join

Merge will concat dataframe based on a specific column instead of index.

In [ ]:
pd.merge(df7,df8,how='outer',on='customer') #outer is union

   customer   cat  imp  sales_x   color  dist  sales_y
0         1  cat1  yes    100.0  yellow  10.0    110.0
1         2  cat2   no    115.0     NaN   NaN      NaN
2         3  cat3  yes     90.0    pink  50.0    215.0
3         4  cat4  yes     80.0    pink  20.0    190.0
4         5   NaN  NaN      NaN   green  15.0    810.0

In [ ]:
pd.merge(df7,df8,how='inner',on='customer') #inner is intersection

   customer   cat  imp  sales_x   color  dist  sales_y
0         1  cat1  yes      100  yellow    10      110
1         3  cat3  yes       90    pink    50      215
2         4  cat4  yes       80    pink    20      190

In [ ]:
pd.merge(df7,df8,how='left',on='customer')  #left gives all the data of left data frame

   customer   cat  imp  sales_x   color  dist  sales_y
0         1  cat1  yes      100  yellow  10.0    110.0
1         2  cat2   no      115     NaN   NaN      NaN
2         3  cat3  yes       90    pink  50.0    215.0
3         4  cat4  yes       80    pink  20.0    190.0

In [ ]:
df9 = pd.DataFrame({'Q1':[101,102,107],
                    'Q2':[200,150,170]},
                   index = ['I0','I1','I2']);
df10 = pd.DataFrame({'Q3':[301,302,307],
                    'Q4':[400,450,470]},
                   index = ['I0','I2','I3']);

In [ ]:
"""Join works similar to Merge. Instead of joining on Column Names,it joins on index labels"""
df9.join(df10,how='left')

     Q1   Q2     Q3     Q4
I0  101  200  301.0  400.0
I1  102  150    NaN    NaN
I2  107  170  302.0  450.0

In [ ]:
#Dataframe functions
df8
df8['color'].unique()

array(['yellow', 'pink', 'green'], dtype=object)

In [ ]:
df8['color'].value_counts()

pink      2
green     1
yellow    1
Name: color, dtype: int64

In [ ]:
df9.mean()

Q1    103.333333
Q2    173.333333
dtype: float64

In [ ]:
df8.columns

Index(['customer', 'color', 'dist', 'sales'], dtype='object')

In [ ]:
df8

   customer   color  dist  sales
4         1  yellow    10    110
5         3    pink    50    215
6         4    pink    20    190
7         5   green    15    810

In [ ]:
new_df = df8[(df8['customer'] != 5) & (df8['color'] != 'pink')];
new_df

   customer   color  dist  sales
4         1  yellow    10    110

In [ ]:
print(df8['sales'].mean());
print(df8['sales'].min());
print(df8['sales'].std());
print(df8['sales'].sum());

331.25
110
322.29321535934736
1325

In [ ]:
def profit(s):
  return s*0.5;

In [ ]:
df8['sales'].apply(profit)

4     55.0
5    107.5
6     95.0
7    405.0
Name: sales, dtype: float64

In [ ]:
df8['color'].apply(len)

4    6
5    4
6    4
7    5
Name: color, dtype: int64

In [ ]:
"""apply will work on a series. applymap will not work on a series ,it works only on Data Frame. it works entry by entry"""
df11 = df8[['sales','dist']];
print(df11);

df11.applymap(profit)

   sales  dist
4    110    10
5    215    50
6    190    20
7    810    15

   sales  dist
4   55.0   5.0
5  107.5  25.0
6   95.0  10.0
7  405.0   7.5

In [ ]:
def col_sum(col):
  return sum(col);

df11.apply(col_sum)
#df11.applymap(col_sum)

sales    1325
dist       95
dtype: int64

In [ ]:
del df8['color'];
df8

   customer  dist  sales
4         1    10    110
5         3    50    215
6         4    20    190
7         5    15    810

In [ ]:
df8.index

Int64Index([4, 5, 6, 7], dtype='int64')

In [ ]:
df8.sort_values(by='dist',inplace=True);
df8

   customer  dist  sales
4         1    10    110
7         5    15    810
6         4    20    190
5         3    50    215

In [ ]:
myDict = pd.DataFrame({'Customer':['customer1','customer1','customer2','customer2','customer3','customer3'],
                       'product1':[1.0,1.3,2.3,4.1,3.2,2.5],
                       'product2':[2.4,5.6,2.1,5.5,3.2,6.9]},index = ['pur1','pur2','pur3','pur4','pur5','pur6']);

myDict

       Customer  product1  product2
pur1  customer1       1.0       2.4
pur2  customer1       1.3       5.6
pur3  customer2       2.3       2.1
pur4  customer2       4.1       5.5
pur5  customer3       3.2       3.2
pur6  customer3       2.5       6.9

In [ ]:
grouped_data = myDict.groupby('Customer');
grouped_data.describe()

          product1                              ... product2
             count  mean       std  min    25%  ...      min    25%   50%    75%  max
Customer                                        ...
customer1      2.0  1.15  0.212132  1.0  1.075  ...      2.4  3.200  4.00  4.800  5.6
customer2      2.0  3.20  1.272792  2.3  2.750  ...      2.1  2.950  3.80  4.650  5.5
customer3      2.0  2.85  0.494975  2.5  2.675  ...      3.2  4.125  5.05  5.975  6.9

[3 rows x 16 columns]

In [ ]:
grouped_data.mean()

           product1  product2
Customer
customer1      1.15      4.00
customer2      3.20      3.80
customer3      2.85      5.05

In [ ]:
df8

   customer  dist  sales
4         1    10    110
7         5    15    810
6         4    20    190
5         3    50    215

In [ ]:
df8.to_csv('sample1.csv',index=True);

In [ ]:
new_df8 = pd.read_csv('sample1.csv',index_col=0);
new_df8

   customer  dist  sales
4         1    10    110
7         5    15    810
6         4    20    190
5         3    50    215

In [ ]:
df8.to_excel('samp.xlsx',index=False,sheet_name="first sheet" )